Reports/ПравилаРаботыСотрудниковКонтрольВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ПравилаРаботыСотрудниковКонтрольВыполнения</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ЦФОСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦФОСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеОбъектРоль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеОбъектРоль</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РольПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРолиID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипРоли</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыРолейПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыРолейПользователя</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПравилаРаботыСотрудниковКонтроль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПравилаРаботыСотрудниковКонтроль</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Распечатано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьПрочтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтролироватьПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФункциональнаяРоль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПерсоналККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаКонтроля</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилаСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыТорговыхТочек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтатусыТорговыхТочек</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СкороОткрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкороЗакрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОтправкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СпособыОтправкиУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ПравилаРаботыСотрудниковКонтрольВыполнения/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет заполнение структуры писем для рассылки информации о состоянии контролируемых правил
// Данные получат управляющие и помощники управляющих (каждый по своим торговым точкам)
//
// Параметры:
//  СправочникСсылка  - <Тип.СправочникСсылка.ПравилаРаботыСотруднико> - Ссылка на справочник (Всегда отправляется последняя версия)
//
Процедура ЗапуститьРассылкуОтчетаПравилРаботыСотрудниковКонтроль(СправочникСсылка = Неопределено) Экспорт

	СтруктураДанных = СформироватьСтруктуруДанныхДляРассылки();

КонецПроцедуры // ЗапуститьРассылкуОтчетаПравираРаботыСотрудниковКонтроль()

// Возвращает структуру данных (получателей, адресов, текстов писем)  для дальнейшего дополнения и рассылке почты
// (Письма отправляются Управляющим и Помощникам управляющих)
//
// Параметры:
//  СправочникСсылка  - <Тип.СправочникСсылка.ПравилаРаботыСотруднико> - Ссылка на справочник (Всегда отправляется последняя версия)
//
// Возвращаемое значение:
//  СтруктураДанных  <Тип.Структура> - Данные для отправки
//
Функция СформироватьСтруктуруДанныхДляРассылки(СправочникСсылка = Неопределено)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО КАК ЦФО,
		|	РолиПользователейСоставРолиТУ.Сотрудник КАК ТерриториальныйУправляющий,
		|	РолиПользователейСоставРоли.Сотрудник КАК ПомощникУправляющего,
		|	СтруктурныеЕдиницы.Ссылка КАК Магазин
		|ПОМЕСТИТЬ ВТ_ТаМагазиныФункРоли
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних(&Период, ) КАК ЦФОСтруктурныхЕдиницСрезПоследних
		|		ПО СтруктурныеЕдиницы.Ссылка = ЦФОСтруктурныхЕдиницСрезПоследних.СтруктурнаяЕдиница
		//+++ AK suvv 2018.06.08 ИП-00018376.01
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&Период, ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникТерриториальногоУправляющего)) КАК СоответствиеОбъектРольСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&Период, ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникТерриториальногоУправляющего) или ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникСтороннейРозницы)) КАК СоответствиеОбъектРольСрезПоследних
		//--- AK suvv
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРоли
		|			ПО СоответствиеОбъектРольСрезПоследних.РольПользователя = РолиПользователейСоставРоли.Ссылка
		|		ПО СтруктурныеЕдиницы.Ссылка = СоответствиеОбъектРольСрезПоследних.Объект
		//+++ AK suvv 2018.06.08 ИП-00018376.01
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&Период, ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникТерриториальногоУправляющего)) КАК СоответствиеОбъектРольСрезПоследнихТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектРоль.СрезПоследних(&Период, ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникТерриториальногоУправляющего) или ТипРоли = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыРолейПользователя.ПомощникСтороннейРозницы)) КАК СоответствиеОбъектРольСрезПоследнихТУ
		//--- AK suvv
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РолиПользователей.СоставРоли КАК РолиПользователейСоставРолиТУ
		|			ПО СоответствиеОбъектРольСрезПоследнихТУ.РольПользователя.Родитель = РолиПользователейСоставРолиТУ.Ссылка
		|		ПО СтруктурныеЕдиницы.Ссылка = СоответствиеОбъектРольСрезПоследнихТУ.Объект
		|ГДЕ
		|	РолиПользователейСоставРолиТУ.Сотрудник ЕСТЬ НЕ NULL 
		|	И СтруктурныеЕдиницы.СтатусТорговойТочки <> ЗНАЧЕНИЕ(Перечисление.СтатусыТорговыхТочек.Закрыт)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ТаМагазиныФункРоли.ТерриториальныйУправляющий КАК ТерриториальныйУправляющий,
		|	ВТ_ТаМагазиныФункРоли.ПомощникУправляющего КАК ПомощникУправляющего,
		|	ПравилаРаботыСотрудниковКонтроль.ДатаКонтроля,
		|	ПравилаРаботыСотрудниковКонтроль.ПравилаСсылка КАК ПравилаСсылка,
		|	ПравилаРаботыСотрудниковКонтроль.СпособОтправки,
		|	ПравилаРаботыСотрудниковКонтроль.ОбъектКонтроля,
		|	ПравилаРаботыСотрудниковКонтроль.Версия,
		|	1 КАК ЕстьМагазин,
		|	ВЫБОР
		|		КОГДА ПравилаРаботыСотрудниковКонтроль.КонтролироватьПрочтение
		|					И НЕ ПравилаРаботыСотрудниковКонтроль.Прочитано
		|				ИЛИ ПравилаРаботыСотрудниковКонтроль.КонтролироватьПечать
		|					И НЕ ПравилаРаботыСотрудниковКонтроль.Распечатано
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтправлятьДанные,
		|	ПравилаРаботыСотрудниковКонтроль.Прочитано,
		|	ПравилаРаботыСотрудниковКонтроль.Распечатано,
		|	ПравилаРаботыСотрудниковКонтроль.КонтролироватьПрочтение,
		|	ПравилаРаботыСотрудниковКонтроль.КонтролироватьПечать,
		|	ВЫРАЗИТЬ(КонтактнаяИнформацияУправляющий.Представление КАК СТРОКА(500)) КАК АдресУправляющего,
		|	ВЫРАЗИТЬ(КонтактнаяИнформацияПомощник.Представление КАК СТРОКА(500)) КАК АдресПомощника
		|ИЗ
		|	РегистрСведений.ПравилаРаботыСотрудниковКонтроль КАК ПравилаРаботыСотрудниковКонтроль
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаМагазиныФункРоли КАК ВТ_ТаМагазиныФункРоли
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияУправляющий
		|			ПО (ВТ_ТаМагазиныФункРоли.ТерриториальныйУправляющий = (ВЫРАЗИТЬ(КонтактнаяИнформацияУправляющий.Объект КАК Справочник.ФизическиеЛица)))
		|				И (КонтактнаяИнформацияУправляющий.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформацияПомощник
		|			ПО (ВТ_ТаМагазиныФункРоли.ПомощникУправляющего = (ВЫРАЗИТЬ(КонтактнаяИнформацияПомощник.Объект КАК Справочник.ФизическиеЛица)))
		|				И (КонтактнаяИнформацияПомощник.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|		ПО (ВТ_ТаМагазиныФункРоли.Магазин = ПравилаРаботыСотрудниковКонтроль.ОбъектКонтроля)
		|ГДЕ
		|	НЕ ПравилаРаботыСотрудниковКонтроль.Выполнено
		|	И ПравилаРаботыСотрудниковКонтроль.СпособОтправки = ЗНАЧЕНИЕ(Перечисление.СпособыОтправкиУведомлений.Магазины)
		|ИТОГИ
		|	МАКСИМУМ(ПравилаСсылка),
		|	МАКСИМУМ(ЕстьМагазин),
		|	МАКСИМУМ(ОтправлятьДанные),
		|	МАКСИМУМ(АдресУправляющего),
		|	МАКСИМУМ(АдресПомощника)
		|ПО
		|	ТерриториальныйУправляющий,
		|	ПомощникУправляющего";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаТеррУправляющий = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаТеррУправляющий.Следующий() Цикл
			
			Выполнено = ВыборкаТеррУправляющий.ОтправлятьДанные = 0;
			
			СформироватьСтруктуруИОтправитьПисьмо("ТерриториальныйУправляющий",ВыборкаТеррУправляющий, ВыборкаТеррУправляющий.АдресУправляющего, Выполнено);
			
			ВыборкаПомощникУправляющего = ВыборкаТеррУправляющий.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПомощникУправляющего.Следующий() Цикл
				
				Выполнено = ВыборкаПомощникУправляющего.ОтправлятьДанные = 0; 
				
				СформироватьСтруктуруИОтправитьПисьмо("ПомощникУправляющего", ВыборкаПомощникУправляющего, ВыборкаПомощникУправляющего.АдресПомощника, Выполнено);

				ВыборкаДетальныеЗаписи = ВыборкаПомощникУправляющего.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл // Отмечать выполненными все "версии" файла на каждую дату контроля отдельно
					
					Если Выполнено Тогда
						РегистрыСведений.ПравилаРаботыСотрудниковКонтроль.УстановитьВыполнениеТребуемыхДействий(Новый Структура("ДатаКонтроля, ПравилаСсылка, СпособОтправки, ОбъектКонтроля", 
								ВыборкаДетальныеЗаписи.ДатаКонтроля, ВыборкаДетальныеЗаписи.ПравилаСсылка, ВыборкаДетальныеЗаписи.СпособОтправки, ВыборкаДетальныеЗаписи.ОбъектКонтроля), Истина);
					КонецЕсли;
							
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

КонецФункции // СформироватьСтруктуруОбъектовДляРассылки()

// Формирует структуру письма и вызывает процедуру отправки
//
// Параметры:
//
//  Выборка  - Тип.ВыборкаЗапроса - Выборка 
//  ИмяПоля  - Тип.Строка  - Имя поля отбора для формировании текста письма
//  ЭлектронныйАдрес       - Тип.Строка - эл. адресы получателей
//  УведомлениеВыполнении  - Тип.Булево - Признак отправки итогового письма о выполнении требования
//
Процедура СформироватьСтруктуруИОтправитьПисьмо(ИмяПоля, Выборка, ЭлектронныйАдрес, УведомлениеВыполнении)

	Если НЕ ЗначениеЗаполнено(ЭлектронныйАдрес) Тогда
		Возврат;
	КонецЕсли;
	
	//Формирование структуры письма
	СтруктураПисьма = Новый Структура();
	
	СтруктураПисьма.Вставить("ПравилаСсылка", Выборка.ПравилаСсылка);
	СтруктураПисьма.Вставить("Отправитель", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоРеквизиту("Логин", "no-reply@vkusvill.ru"));  
	СтруктураПисьма.Вставить("Получатели",  "" + ЭлектронныйАдрес + ";" + "mika@automacon.ru");
	СтруктураПисьма.Вставить("ОшибкаОтправки", Неопределено);
	СтруктураПисьма.Вставить("ОписаниеОшибки", Неопределено);
	
	СтруктураПисьма.Вставить("Тема", ?(УведомлениеВыполнении, "ВЫПОЛНЕНО! Пользователи успешно обработали(прочитали/распечатали) требования к правилам ", 
			"Состояние выполнения требований (прочтение/печать) к правилам ") + Выборка.ПравилаСсылка + " " + Выборка[ИмяПоля]); 
	
	СтруктураПисьма.Вставить("Текст", ПолучитьТекстПисьмаДляОтправки(ИмяПоля, Выборка));
	
	Документы.ИзменениеЗакупочныхЦен.ОтправитьПисьмо(СтруктураПисьма); //Откомментировать после утверждения структуры подчиненности рассылки
	
КонецПроцедуры // СформироватьСтруктуруИОтправитьПисьмо()

// Формирует и возвращает текст письма (содержит информацию о выполнении требований)
//
// Параметры:
//    ИмяПоля  - Тип.Строка - Имя поля отбора для формировании текста письма
//
// Возвращаемое значение:
//   <Тип.Строка> - Текст HTML
//
Функция ПолучитьТекстПисьмаДляОтправки(ИмяПоля, Выборка)

	//Формирование текста HTML письма 
	СхемаКомпоновкиДанных = Отчеты.ПравилаРаботыСотрудниковКонтрольВыполнения.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	НастройкиКомпоновкиДанных = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Рассылка").Настройки;
	
	//Установка отборов
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ПравилаСсылка"); 
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Выборка.ПравилаСсылка; 
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяПоля); 
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Выборка[ИмяПоля]; 
	ЭлементОтбора.Использование  = Истина;
	
	//Выполнение компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанных")); 
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ТабДок = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	// Запись в HTML файл
	МассивДляУдаления = Новый Массив();
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	МассивДляУдаления.Добавить(ИмяФайла);
	
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяФайла);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();

КонецФункции // ПолучитьТекстПисьмаДляОтправки()
